In [1]:
import pandas as pd

In [2]:
df = pd.read_html('http://sos.ga.gov/elections/election_results/2006_1107/006.htm')

In [3]:
df = df[0]

In [4]:
df.head(5)

,0,1,2,3,4,5
0,NaN,NaN,NaN,"Handel (R) 1,116,216","Buckner (D) 862,412","Madsen (Lib) 84,670"
1,NaN,NaN,NaN,54.1%,41.8%,4.1%
2,County,PR,TP,NaN,NaN,NaN
3,APPLING,19,19,2362,1383,104
4,ATKINSON,6,6,787,572,45

In [5]:
df = df[3:]

In [6]:
df.head(5)

          0   1   2     3     4    5
3   APPLING  19  19  2362  1383  104
4  ATKINSON   6   6   787   572   45
5     BACON   7   7  1185   847   77
6     BAKER   7   7   356   528   23
7   BALDWIN  16  16  4424  4906  342

In [7]:
df = df.drop(df.columns[[1,2]], axis=1)

In [8]:
df.head(5)

          0     3     4    5
3   APPLING  2362  1383  104
4  ATKINSON   787   572   45
5     BACON  1185   847   77
6     BAKER   356   528   23
7   BALDWIN  4424  4906  342

In [9]:
df.columns = ['county', 'Karen Handel', 'Gail Buckner', 'Kevin Madsen']

In [10]:
df.tail(5)

        county Karen Handel Gail Buckner Kevin Madsen
157  WHITFIELD        10434         5154          531
158     WILCOX         1024          797           56
159     WILKES         1323         1186           94
160  WILKINSON         1141         1456          101
161      WORTH         2749         2006          110

In [11]:
df = df.melt(id_vars=['county'])

In [12]:
df.columns = ['county', 'candidate', 'votes']

In [13]:
df.head()

     county     candidate votes
0   APPLING  Karen Handel  2362
1  ATKINSON  Karen Handel   787
2     BACON  Karen Handel  1185
3     BAKER  Karen Handel   356
4   BALDWIN  Karen Handel  4424

In [39]:
df['votes'] = df['votes'].astype(int)

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 477 entries, 0 to 476
Data columns (total 3 columns):
county       477 non-null object
candidate    477 non-null object
votes        477 non-null int64
dtypes: int64(1), object(2)
memory usage: 11.3+ KB

In [42]:
df['office'] = 'Secretary of State'

In [44]:
df['district'] = ''

In [46]:
df['party'] = ''

In [57]:
df.loc[df['candidate'] == 'Karen Handel', 'party'] = 'Republican'
df.loc[df['candidate'] == 'Gail Buckner', 'party'] = 'Democrat'
df.loc[df['candidate'] == 'Kevin Madsen', 'party'] = 'Libertarian'

In [59]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate     party
Gail Buckner  Democrat        862412
Karen Handel  Republican     1116216
Kevin Madsen  Libertarian      84670
Name: votes, dtype: int64

In [58]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

     county              office district       party     candidate  votes
0   APPLING  Secretary of State           Republican  Karen Handel   2362
1  ATKINSON  Secretary of State           Republican  Karen Handel    787
2     BACON  Secretary of State           Republican  Karen Handel   1185
3     BAKER  Secretary of State           Republican  Karen Handel    356
4   BALDWIN  Secretary of State           Republican  Karen Handel   4424

In [61]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')